module attributes {llvm.data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", llvm.target_triple = "x86_64-unknown-linux-gnu"} {
  func.func @main_graph(%arg0: tensor<1x32xf32>) -> tensor<1x16xf32> attributes {input_names = ["x"], output_names = ["71"]} {
    %0 = onnx.Constant dense<146> : tensor<ui8>
    %1 = onnx.Constant dense<0.0193496719> : tensor<f32>
    %2 = "onnx.QuantizeLinear"(%arg0, %1, %0) {axis = 1 : si64, onnx_node_name = "/quant/QuantizeLinear"} : (tensor<1x32xf32>, tensor<f32>, tensor<ui8>) -> tensor<1x32xui8>
    %3 = onnx.Constant dense<0.0193496719> : tensor<f32>
    %4 = onnx.Constant dense<146> : tensor<ui8>
    %5 = "onnx.DequantizeLinear"(%2, %3, %4) {axis = 1 : si64, onnx_node_name = "/fc1/DequantizeLinear"} : (tensor<1x32xui8>, tensor<f32>, tensor<ui8>) -> tensor<1x32xf32>
    %6 = onnx.Constant dense<"0xD58E72E43303B37281EA8132E0B9FBCB34553101104A0D5DE819EC5CFE9E9DCF598F56751BAC9784D70A2A8EAC4BAF601CABA2F8ECC03802EA13B9700DB06E820EACDC8BECE0410A50023059523EA57A8A854814E6BCBAF62710CD9B0809AB4CC0AC48A2E6BB7CEDE59FA5D1D6B1E7EF72F37F89AA9E2BC49944384C441F257C1812BBC71A29445E074CB89C862B26659AF96CAA71B895B147F8ACDDDCDE0F601C1B2296689F7DDF8AEE8D55F7BA8DF4A339DA3122CBE175F08373CFACD765498966D4E0A3E07F229ED46CA970D1EDBA3799328186D973496B3D7B5165E6645250776E8B039DEB92E910EFF2CDB07C3D5CD25CCEC522F7BF979A4D75E22933346924E42EDAA5DBC10E00718A12D3B155D41882B98BBE37EB18BE68BF5FAB6F5D63BC8150A2ACCE3F823B8186E1E4877227E0617CCBC1F2E4E32E4F081C5676AD5DAFCE0FA8936D025DD3BD516ECC77D42C0C0C9F9BCF7E9DCA8531069E78EAD02AB76482B90F1D571EB69B12C42547799E5196819B40513D9FAF4D143468F9AA745320DB161A5D618F3AF9B874F791228CFACE5E2D68DB94AD3FBBAF91AB038A91C239BB67EE263AED5AB8813FD58EB3A5FDE8577D3A080D46628DC7CB1A75FE70F9F813844BE7630ACFD44477B3B99B0C27B9647E2178577D5AACC63D91FC6949991603C30BD01BC960BFD0A622461B0CE21D0267F8745E604E7D7C0C23EA3DBA902E3A3273F9EE620784DBAFB7CBC215F0BF54C2A8A483BB24D39998F5D29BC17C1B49ED4ECC0C49537563F552867EE7DD0261C49927A2924058A61C91CF8C0706BF0F2ED606F12451EEF6A97862B94D11F2E4966ACEA14382095B21848E8BE8C644A77812D33D661CE11A1D2EBD37567063AA71828837B4D0996CAE1F740DB23989433142B6CA1837CCBBFDBA2CE3769FA7D535DAED08166E5588847649A67A8BE3B854ECB228C125049FEAC7B78498BB2BE5E771681CBEFD63EC84ACD2517B129A2CFFD0CD9141F676A244F141ED9A718F8F12093A813626A0B0B81B27BE908A7C6316ACF49FEF78AB150AB8EBB6CB041051D23CC25785B9D611A2482E030B9B56BB64B69BA64E3F1765CBAFE04438944513B94FD7691BAB289E6251F59AD59924BA8EEE96F609FE82A65478AE62E26A8665AC82673F503C300F2AE588AE3A2A6DC7FFB3187F957B98D45912818E828F4C23CC25183C3DDFC4DCD7C9276DCBF7F3FBE56F420BB60C0FAE4F9728F7D0CE101A797C7A61A699671586B6D1980B8157E3ABF382BC5376B47826914AD7A3CC30DE317FB25CD3B14E7F96271AB33D7251E2E4DE15E7228586F8D3790C865BBBAC4F3D093702B1A6F1E2F3944A597591C85538C95120E6015A16D062F2CF660678C4192140D719E486BE9478694BC6A395DEC59906D70F01CB9BC17B821E2300D0D7870382A9A69712A45062D3A0109E2A3F4E37950CC43BDCB2905258693F09F442B7D3795BEB9C11EEABB04F531B3B90A58D2F306C631BC79554D40CDE380241033868DFCAD615B326EF3A7338F0557F719EE46105A8CE3C14A1B632993E10E7E37C0CF8256721067A5F4E041AFDAFE2214F4E39127FCB5AA9D86B5FF558C70ACA9E7417055FF2DF3BD4EDBEE720387F09A3A00B4292E88D37662FC8A321FA25D1DAF8C24F21FF8F201D81C7331AF4246011754F869834D11FA8824A99AA0DB0559A69373D01E1D32A42DC679AB3441DE12E1E6B9491518561586ED64B2ADAB90ACACD26E402A35644309E1831CB6D8595FF06CCDB573F7F7470837326E9D8E86A65DA0816B598E045E3C27FCA39A86B3ED55ED1E31A2C331712B951697A0F89FE16CC3EB66E6E41F13CCC162DCCD04C361E3E3A88EF42825445C333CDE912CEB969F192E72DD587A523F8E6691181BFF84F1069377F463D589E1C5F0F5962B070B2415720AFD4D158F77CB86138037F9E2AAFCE6EB1C1A67F85B2785133033A09DE98FC8F88E8AF8E569E3FDB3EEA3C1F3A7337FE6E3D358B38133BFE91860172393CF27C268BE1BCE0B5940371DA79595824D4AE7894419E3DEB8CBB0B6A5AC59454E5E08F5118A3A0DA1C7E4C2F5097C87B469F86CC2FE8DD535334444129FA21E15FB65D431BC83AFF373AF8C104B96663838FEA99170B3FA1122CFA29C9EF9CB9B066716DA66F69ED2B57E7CC19F2CFE402970801F2B8609E5475B7299B1800516D916DC7DEA9D7E9FBC75EC51E600D056A8581CCCD2FAF3A4545C0027D535FBAAAE63700FA8E8F9A82E9D907887859B3939CF22C106DD1AF19E4FB30B609A0783E52F9DFAEAFED3023618E04DD343EE47EBBE44C43B982290021E0EA4585D1CEBBB14715855E31185CCA44178E3347238F6FE936CB008F59E6EEF20E84DFF9CDA681FDEB3CE0B4DE2D8B7413AF7817CF2353B81A2EF2187A737FE94F6239B5D742F72C50DA33233FEF349573BD19069D1F3D4BB28E4C5A35F9BD0E7B8DC3A1F965652C1E47616F191EF91995F426BEF78FB359E2AC510215E2250998D16546F53D0A825602DD0BC85858C643E52E0C8844BCEE520B6A56D5A847CBFCE9752B7AE8AD4910885E37BECEB10519A04E17A90764AA7E2DFD15BA91952B70BF6479B431E7B33E8E0A1AF9828EAFB38AF663B0BB157905BDBF4C7AFF24CC5CE688AC5BE4783A88C844B895A41313681E61787B1276890C79C0DB2361B4533626612710C86337D0EA6B0F0AB5045F678A76E012EAE8D1D0F85338376BC9B21A9E7625F87C88D3A92462B6215848B7082B0C66A9E8509CA57507B24B3B42FD59740D1656357FF5CA8F1FA70248282119F01D60B22C70F21AA584FF3794C4F689201E42A2C1F038DB5A1A1DF6F8855E486F81FFE3DFA2F433A8E6E18728510D7EE0CCBCC1A3BDB38D4A6877100F19"> : tensor<64x32xi8>
    %7 = onnx.Constant dense<0.0013856095> : tensor<1xf32>
    %8 = onnx.Constant dense<0> : tensor<1xi8>
    %9 = "onnx.DequantizeLinear"(%6, %7, %8) {axis = 1 : si64, onnx_node_name = "/fc1/DequantizeLinear_1"} : (tensor<64x32xi8>, tensor<1xf32>, tensor<1xi8>) -> tensor<64x32xf32>
    %10 = onnx.Constant dense<1> : tensor<1xi64>
    %11 = onnx.ConstantOfShape(%10) {onnx_node_name = "/fc1/ConstantOfShape", value = dense<0> : tensor<1xi32>} : (tensor<1xi64>) -> tensor<1xi32>
    %12 = onnx.Constant dense<[5770, -342, 4029, -1007, 6238, 1356, 4677, 798, -4606, 4641, -703, -4449, -2861, -1403, 5649, 5859, -6078, -5803, 3716, -59, 6204, 3521, -4462, -1495, -135, -3101, 4029, -1704, 2413, 172, 5917, 4554, -39, 6109, -4971, 3936, 3246, -2968, 2366, -1448, -383, -2660, -3804, -2291, 3637, -2013, 4923, 2325, -5471, 3986, -944, -6276, -4064, 597, -6582, -4528, 6318, -6205, 2447, 1081, 1671, -2995, -3748, 4341]> : tensor<64xi32>
    %13 = onnx.Constant dense<2.68110889E-5> : tensor<1xf32>
    %14 = "onnx.DequantizeLinear"(%12, %13, %11) {axis = 1 : si64, onnx_node_name = "/fc1/DequantizeLinear_2"} : (tensor<64xi32>, tensor<1xf32>, tensor<1xi32>) -> tensor<64xf32>
    %15 = "onnx.Gemm"(%5, %9, %14) {alpha = 1.000000e+00 : f32, beta = 1.000000e+00 : f32, onnx_node_name = "/fc1/Gemm", transA = 0 : si64, transB = 1 : si64} : (tensor<1x32xf32>, tensor<64x32xf32>, tensor<64xf32>) -> tensor<1x64xf32>
    %16 = onnx.Constant dense<0.0159176141> : tensor<f32>
    %17 = onnx.Constant dense<136> : tensor<ui8>
    %18 = "onnx.QuantizeLinear"(%15, %16, %17) {axis = 1 : si64, onnx_node_name = "/fc1/QuantizeLinear"} : (tensor<1x64xf32>, tensor<f32>, tensor<ui8>) -> tensor<1x64xui8>
    %19 = onnx.Constant dense<0.0159176141> : tensor<f32>
    %20 = onnx.Constant dense<136> : tensor<ui8>
    %21 = "onnx.DequantizeLinear"(%18, %19, %20) {axis = 1 : si64, onnx_node_name = "/act1/DequantizeLinear"} : (tensor<1x64xui8>, tensor<f32>, tensor<ui8>) -> tensor<1x64xf32>
    %22 = "onnx.Relu"(%21) {onnx_node_name = "/act1/Relu"} : (tensor<1x64xf32>) -> tensor<1x64xf32>
    %23 = "onnx.QuantizeLinear"(%22, %19, %20) {axis = 1 : si64, onnx_node_name = "/act1/QuantizeLinear"} : (tensor<1x64xf32>, tensor<f32>, tensor<ui8>) -> tensor<1x64xui8>
    %24 = onnx.Constant dense<0.0159176141> : tensor<f32>
    %25 = onnx.Constant dense<136> : tensor<ui8>
    %26 = "onnx.DequantizeLinear"(%23, %24, %25) {axis = 1 : si64, onnx_node_name = "/fc2/DequantizeLinear"} : (tensor<1x64xui8>, tensor<f32>, tensor<ui8>) -> tensor<1x64xf32>
    %27 = onnx.Constant dense<"0xDEBE9E797F2FB3058B4DC35F34C2EBC57CDB557A8A07880AC0D4F056CBF369A599DAC1E7511D0611F144AD70A9A1DD582821B38D924401EC579C3E00D8454D338D66A1F3C929B00EAC69B0CD84D5BAE0B9346DED2170C9E9DA34829FEEF430586652B1D268C370046A6E0B0DF47A81EF86A139EA0C66026A8C7F276CC7DDAD6703DCA9035BC4B9BDC631C042AEE032D4E5FEBAB1CE4040D9CFE920FB6FB09FD37E4CD930548497849EE8D3FAA060D0D9E3BE1433FC634CB372859FB9E7B562690D5E7F4019D9D0B917036FC6C32F3592BC84D64467FB8D2009A8267245071191C50931F5512C1A6BECCFE94FEBB37B8A2574609263E218E5B915AD2AD9D70EA40C2B5657222684B91493113FC5B5913E4B00FDC8D7CAC7D51D675894A6895085A92B5FAC9446BAE7C1D5711655F9DD117EDD341C1B6ADC13C8D8382E70C19004EA105B8CA120654816390FA68D0A71E0401292EEFB301641906566722F11798F54E246EBC10EFB67C6BFFF18558C08CA0B3441E6118312F4CFED708BDA7D47624ACB14798D5C791E02484954796D43315D0A5ADFCC24BCA7CF0AA2106F844E050666062716C7720478E9F14388E4F1879F9D30FF4F4DE7AFE72538007C6053F8EFA3EECBD72F76D949D4CC045869F37887D546109E57A10E5961CCA1532A3D9281FDD0E3EC2ED6BA6C76458124E3C99BCC9FE125B163D4D5174A0A962DFA97DC135A5BBBDED9B5689C7DEB17C71412DB7883475983917D8DCDA9FC6534663C67FBF4797491D30C6FB42F0C842C18EA39F4E96E68F8C1EDD143C3B023C67E31A59475ACDB2C09C9A1D25573EEB985BCD2F1D39F0CDF3331DC75371CC4B60D93066E6DE596B7CE1F4CF8B7F4E23CB321810E61186FAB6ACA3C2BFF8D55A5BEDDB770B3705DF293BC4F4766E9EE7A79670ABAEE0118DAF847326B3E06D8DB773E7F07C5CF6817AF8448E1303F8CFB03FFD63A82FD68181B09E84460563A2892F013813878B9BE43B75A2789F5A6BE8E2638C139FC8B95DDCC2F066887F3CAEE91F8DFAC7DBC4B830D9583EF3A9561C94A55C0640B18ECF974C932179C97D5824A61D56E49C4A9B01A395061AAF08AF681E9BDD24D674566B934FD20973F830E7A64022F959AEDA4E068FDF59D33924BB0F7A336A9854B8862421966FC2D9523F6816106E277229DF05FED4D45AF1C3ED6C6EF7A9B0B87B44CA6731C0F110327FB399DE0A3BA3C6DCCC8E02CC34424AE85535C5DDE77F68828827FA35B0A8C22DE0DEC29D868F65020B92CB7C2542CC16A2F23E7236E37EB6CEA4F49AB7E44A7297D65BE48AFDDA8A5B251304B467FA9F3F02D38C5FBEE6E0F3DF593CF8E4806D2FFC383D9EC758A8A61AD52330C0D8F2CE2EBAED96A4867989D47ABC01DD512F379518EB0DF74606CB3592217D58A0EDBAD959741C6C4B9D7F4DBE34C447DB286DE"> : tensor<16x64xi8>
    %28 = onnx.Constant dense<9.79857519E-4> : tensor<1xf32>
    %29 = onnx.Constant dense<0> : tensor<1xi8>
    %30 = "onnx.DequantizeLinear"(%27, %28, %29) {axis = 1 : si64, onnx_node_name = "/fc2/DequantizeLinear_1"} : (tensor<16x64xi8>, tensor<1xf32>, tensor<1xi8>) -> tensor<16x64xf32>
    %31 = onnx.Constant dense<1> : tensor<1xi64>
    %32 = onnx.ConstantOfShape(%31) {onnx_node_name = "/fc2/ConstantOfShape", value = dense<0> : tensor<1xi32>} : (tensor<1xi64>) -> tensor<1xi32>
    %33 = onnx.Constant dense<[-7194, 3132, -4168, 3464, -6591, -2120, -6698, -2762, -5537, -7337, -5050, -3015, -2522, 1363, 3077, -5213]> : tensor<16xi32>
    %34 = onnx.Constant dense<1.55969938E-5> : tensor<1xf32>
    %35 = "onnx.DequantizeLinear"(%33, %34, %32) {axis = 1 : si64, onnx_node_name = "/fc2/DequantizeLinear_2"} : (tensor<16xi32>, tensor<1xf32>, tensor<1xi32>) -> tensor<16xf32>
    %36 = "onnx.Gemm"(%26, %30, %35) {alpha = 1.000000e+00 : f32, beta = 1.000000e+00 : f32, onnx_node_name = "/fc2/Gemm", transA = 0 : si64, transB = 1 : si64} : (tensor<1x64xf32>, tensor<16x64xf32>, tensor<16xf32>) -> tensor<1x16xf32>
    %37 = onnx.Constant dense<0.00384936598> : tensor<f32>
    %38 = onnx.Constant dense<133> : tensor<ui8>
    %39 = "onnx.QuantizeLinear"(%36, %37, %38) {axis = 1 : si64, onnx_node_name = "/fc2/QuantizeLinear"} : (tensor<1x16xf32>, tensor<f32>, tensor<ui8>) -> tensor<1x16xui8>
    %40 = onnx.Constant dense<0.00384936598> : tensor<f32>
    %41 = onnx.Constant dense<133> : tensor<ui8>
    %42 = "onnx.DequantizeLinear"(%39, %40, %41) {axis = 1 : si64, onnx_node_name = "/dequant/DequantizeLinear"} : (tensor<1x16xui8>, tensor<f32>, tensor<ui8>) -> tensor<1x16xf32>
    return %42 : tensor<1x16xf32>
  }
  "onnx.EntryPoint"() {func = @main_graph} : () -> ()
}
